{
  "main": {
    "name":"Ihsan Rawi",
    "occupation":"Software Engineer",
    "description":"Fullstack Software Engineer by day, self learner at night.",
    "image":"profilepic.jpg",
    "bio":"I'm a software engineer with 3 years experience developing business critical application in Banking and Distribution Management Systems. A self thought ReactJS developer with hunger for knowledge. Previously, I had work for Accenture as fullstack ASP.Net developer and had experience working with hybrid mobile apps development, reporting services and database optimisation. ",
    "contactmessage":"Think I'd be a good fit for your team? I'd love to hear from you, give me a shout by email or by using the form below if you'd like to get in contact with me.",
    "email": "rawiihsan@gmail.com",
    "phone": "+44 775 1566 067",
    "address":{
      "street":"Ramsgate Road",
      "city":"Margate",
      "state":"UK",
      "zip": "CRT9 5RT"
    },
    "website": "http://www.timbakerdev.com",
    "resumedownload":"https://drive.google.com/file/d/1yDmBjLGE3qaA0ycLP-m8qJyM6a5dCTBg/view?usp=sharing",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/ihsanrawi/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"https://github.com/ihsanrawi",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"I always improving my skills and interested in testing around with new technologies but these are the ones that have really won me over",
    "education":[
      {
        "school":"University of Nottingham Malaysia Campus",
        "degree":"BSc. Software Engineering",
        "graduated":"May 2017",
        "description":"Graduated with 2:1."
      }
    ],
    "work":[
      {
        "company":"Accenture ",
        "title":"Application Development Analyst ",
        "years":"October 2018 - September 2020",
        "location": "Kelana Jaya, Malaysia",
        "description":"I was assign to Accenture subsidiary company Newspage which specialized in Distribution Management System application as Full stack ASP.Net developer. I had involved in all parts of the system including their proprietary hybrid mobile application, reporting service, database optimization and deployment. \n\nI was responsible for developing, deploying, mantaining and supporting this system to one of their client project team. I had also involved in internal project to develop the next version of their hybrid mobile application. \n\nSome highlight of my employment in Accenture Newspage, I had led a team of 3 for application server migration comprising 27 countries market environment"
      },
      {
        "company":"Infopro Sdn. Bhd.",
        "title":"System Engineer",
        "years":"October 2017 - September 2018",
        "location": "Petaling Jaya, Malaysia",
        "description":"Describe work, special projects, notable achievements, what technologies you have been working with, and anything else that would be useful for an employer to know."
      }
    ],
    "skills":[
      {
        "name":"Git",
        "level":"60%"
      },
      {
        "name":"Illustrator",
        "level":"55%"
      },
      {
        "name":"ReactJs",
        "level":"50%"
      },
      {
        "name":"CSS",
        "level":"90%"
      },
      {
        "name":"HTML5",
        "level":"80%"
      },
      {
        "name":"VueJs",
        "level":"50%"
      },
      {
        "name":"MongoDB",
        "level":"80%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Canadian Wanderlust",
        "category":"My Travel Blog for my post-university travels",
        "image":"canadian-wanderlust.jpg",
        "url":"https://www.canadianwanderlust.com"
      },
      {
        "title":"Fury Fighting Gear",
        "category":"(offline now) A fighting gear company I started",
        "image":"fury-fighting-gear.jpg",
        "url":"http://www.timbakerdev.com"
      }
    ]
  },
  "testimonials":{
    "testimonials":[
      {
        "text":"Here you should write some nice things that someone has said about you. No lies though, employers can tell when you are lying.",
        "user":"Kareem Abdul Jabbar"
      },
      {
        "text":"That Ihsan Rawi must be one of the most brilliant developers I've ever met! It is amazing that nobody has hired him yet. Hey you, you should hire this guy, he may be fresh out of University and have zero on the job experience but I am confident that he will be one of your best developers in no time!",
        "user":"Steve Wozniak... impersonator"
      }
    ]
  }
}
